research_lab/app/Controllers/MembersController.php

    public function index()
    {
        $model = new MemberModel();
        $data['members'] = $model->findAll(); // 데이터베이스에서 모든 구성원 가져오기
---
SELECT *
FROM `members`

    public function member_details($name) {
        $model = new MemberModel();

        $member = $model->where('en_name', $name)->first();
---
SELECT *
FROM `members`
WHERE `en_name` = 'sangkyunjeon'
 LIMIT 1